MaiLangYang/mcu_project_template/firmware/cmsis/GD/GD32A7xx/Source/IAR/startup_gd32a74xx.s
;                /* get the DTCM size */
                 LDR     R0, =0x40010254
                 LDR     R2, [R0]
                 LDR     R0, = 0xFF000000
                 AND     R2, R2, R0
                 LSR     R2, R2, #24
                 ADD     R2, #8
                 MOV     R1, #1
;                /* Calculates the DTCM byte size */
                 LSL     R1, R1, R2
;                /* Stores DTCM capacity values for SRAM initialization */
                 MOV     R3, R1
;                /* Initialize the DTCM */
                 LDR     R0, =0x20000000
                 ADD     R1, R0, R1
                 MOV     R2, #0x0
DTCMSRAM_INIT    STRD    R2, R2, [ R0 ], #8
                 CMP     R0, R1
                 BNE     DTCMSRAM_INIT

;                /* get the ITCM size */
                 LDR     R0, =0x40010254
                 LDR     R2, [R0]
                 LDR     R0, = 0x00FF0000
                 AND     R2, R2, R0
                 LSR     R2, R2, #16
                 ADD     R2, #8
                 MOV     R1, #1
;                /* Calculates the ITCM byte size */
                 LSL     R1, R1, R2
;                /* Stores ITCM capacity values for SRAM initialization */
                 MOV     R4, R1
;                /* Initialize the ITCM */
                 LDR     R0, =0x00000000
                 ADD     R1, R0, R1
                 MOV     R2, #0x0
ITCMSRAM_INIT    STRD    R2, R2, [ R0 ], #8
                 CMP     R0, R1
                 BNE     ITCMSRAM_INIT

;                /* get the SRAM + DTCM + ITCM size */
                 LDR     R0, =0x1FFFF7E0
                 LDR     R1, [R0]
                 LDR     R0, = 0xFFFF0000
                 AND     R1, R1, R0
                 LSR     R1, R1, #16
                 LSL     R1, R1, #10
;                /* Calculates the DTCM + ITCM byte size */
                 ADD     R3, R4
;                /* Calculates the SRAM byte size */
                 SUB     R1,R3
;                /* Initialize the SRAM */
                 LDR     R0, =0x24000000
                 ADD     R1, R0, R1
                 MOV     R2, #0x0
SRAM_INIT        STRD    R2, R2, [ R0 ], #8
                 CMP     R0, R1
                 BNE     SRAM_INIT

                 LDR     R0, =SystemInit
                 BLX     R0
                 LDR     R0, =__iar_program_start
                 BX      R0

        PUBWEAK NMI_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
NMI_Handler
        B NMI_Handler

        PUBWEAK HardFault_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
HardFault_Handler
        B HardFault_Handler

        PUBWEAK MemManage_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
MemManage_Handler
        B MemManage_Handler

        PUBWEAK BusFault_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
BusFault_Handler
        B BusFault_Handler

        PUBWEAK UsageFault_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
UsageFault_Handler
        B UsageFault_Handler

        PUBWEAK SVC_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
SVC_Handler
        B SVC_Handler

        PUBWEAK DebugMon_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
DebugMon_Handler
        B DebugMon_Handler

        PUBWEAK PendSV_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
PendSV_Handler
        B PendSV_Handler

        PUBWEAK SysTick_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
SysTick_Handler
        B SysTick_Handler

        PUBWEAK WWDGT0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
WWDGT0_IRQHandler
        B WWDGT0_IRQHandler

        PUBWEAK HVD_LVD_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HVD_LVD_IRQHandler
        B HVD_LVD_IRQHandler

        PUBWEAK RTC_Alarm_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RTC_Alarm_IRQHandler
        B RTC_Alarm_IRQHandler

        PUBWEAK RTC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RTC_IRQHandler
        B RTC_IRQHandler

        PUBWEAK FMC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FMC_IRQHandler
        B FMC_IRQHandler

        PUBWEAK RCU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RCU_IRQHandler
        B RCU_IRQHandler

        PUBWEAK EXTI0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI0_IRQHandler
        B EXTI0_IRQHandler

        PUBWEAK EXTI1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI1_IRQHandler
        B EXTI1_IRQHandler

        PUBWEAK EXTI2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI2_IRQHandler
        B EXTI2_IRQHandler

        PUBWEAK EXTI3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI3_IRQHandler
        B EXTI3_IRQHandler

        PUBWEAK EXTI4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI4_IRQHandler
        B EXTI4_IRQHandler

        PUBWEAK DMA0_Channel0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel0_IRQHandler
        B DMA0_Channel0_IRQHandler

        PUBWEAK DMA0_Channel1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel1_IRQHandler
        B DMA0_Channel1_IRQHandler

        PUBWEAK DMA0_Channel2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel2_IRQHandler
        B DMA0_Channel2_IRQHandler

        PUBWEAK DMA0_Channel3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel3_IRQHandler
        B DMA0_Channel3_IRQHandler

        PUBWEAK DMA0_Channel4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel4_IRQHandler
        B DMA0_Channel4_IRQHandler

        PUBWEAK DMA0_Channel5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel5_IRQHandler
        B DMA0_Channel5_IRQHandler

        PUBWEAK DMA0_Channel6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel6_IRQHandler
        B DMA0_Channel6_IRQHandler

        PUBWEAK ADC0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ADC0_IRQHandler
        B ADC0_IRQHandler

        PUBWEAK CAN0_Message_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN0_Message_IRQHandler
        B CAN0_Message_IRQHandler

        PUBWEAK CAN0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN0_IRQHandler
        B CAN0_IRQHandler

