MaiLangYang/mcu_project_template/firmware/cmsis/GD/GD32A7xx/Source/IAR/startup_gd32a74xx.s
        PUBWEAK CAN4_ECCERR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN4_ECCERR_IRQHandler
        B CAN4_ECCERR_IRQHandler

        PUBWEAK DAC1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DAC1_IRQHandler
        B DAC1_IRQHandler

        PUBWEAK HSM_COM0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HSM_COM0_IRQHandler
        B HSM_COM0_IRQHandler

        PUBWEAK HSM_COM1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HSM_COM1_IRQHandler
        B HSM_COM1_IRQHandler

        PUBWEAK FMU_CAT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FMU_CAT_IRQHandler
        B FMU_CAT_IRQHandler

        PUBWEAK RCTL_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RCTL_IRQHandler
        B RCTL_IRQHandler

        PUBWEAK IOC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
IOC_IRQHandler
        B IOC_IRQHandler

        PUBWEAK SPI2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI2_IRQHandler
        B SPI2_IRQHandler

        PUBWEAK SPI3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI3_IRQHandler
        B SPI3_IRQHandler

        PUBWEAK SPI4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI4_IRQHandler
        B SPI4_IRQHandler

        PUBWEAK SPI5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI5_IRQHandler
        B SPI5_IRQHandler

        PUBWEAK SPI6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI6_IRQHandler
        B SPI6_IRQHandler

        PUBWEAK SPI7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI7_IRQHandler
        B SPI7_IRQHandler

        PUBWEAK QSPI_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
QSPI_IRQHandler
        B QSPI_IRQHandler

        PUBWEAK USART3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USART3_IRQHandler
        B USART3_IRQHandler

        PUBWEAK USART4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USART4_IRQHandler
        B USART4_IRQHandler

        PUBWEAK USART5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USART5_IRQHandler
        B USART5_IRQHandler

        PUBWEAK CAN2_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN2_WKUP_IRQHandler
        B CAN2_WKUP_IRQHandler

        PUBWEAK CAN3_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN3_WKUP_IRQHandler
        B CAN3_WKUP_IRQHandler

        PUBWEAK CAN4_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN4_WKUP_IRQHandler
        B CAN4_WKUP_IRQHandler

        PUBWEAK CAN5_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN5_WKUP_IRQHandler
        B CAN5_WKUP_IRQHandler

        PUBWEAK CAN6_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN6_WKUP_IRQHandler
        B CAN6_WKUP_IRQHandler

        PUBWEAK CAN7_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN7_WKUP_IRQHandler
        B CAN7_WKUP_IRQHandler

        PUBWEAK CAN2_Message_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN2_Message_IRQHandler
        B CAN2_Message_IRQHandler

        PUBWEAK CAN2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN2_IRQHandler
        B CAN2_IRQHandler

        PUBWEAK CAN3_Message_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN3_Message_IRQHandler
        B CAN3_Message_IRQHandler

        PUBWEAK CAN3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN3_IRQHandler
        B CAN3_IRQHandler

        PUBWEAK CAN4_Message_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN4_Message_IRQHandler
        B CAN4_Message_IRQHandler

        PUBWEAK CAN4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN4_IRQHandler
        B CAN4_IRQHandler

        PUBWEAK CAN5_Message_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN5_Message_IRQHandler
        B CAN5_Message_IRQHandler

        PUBWEAK CAN5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN5_IRQHandler
        B CAN5_IRQHandler

        PUBWEAK CAN6_Message_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN6_Message_IRQHandler
        B CAN6_Message_IRQHandler

        PUBWEAK CAN6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN6_IRQHandler
        B CAN6_IRQHandler

        PUBWEAK CAN7_Message_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN7_Message_IRQHandler
        B CAN7_Message_IRQHandler

        PUBWEAK CAN7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN7_IRQHandler
        B CAN7_IRQHandler

        PUBWEAK TIMER19_CC0_CC0N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER19_CC0_CC0N_IRQHandler
        B TIMER19_CC0_CC0N_IRQHandler

        PUBWEAK TIMER19_CC1_CC1N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER19_CC1_CC1N_IRQHandler
        B TIMER19_CC1_CC1N_IRQHandler

        PUBWEAK TIMER19_CC2_CC2N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER19_CC2_CC2N_IRQHandler
        B TIMER19_CC2_CC2N_IRQHandler

        PUBWEAK TIMER19_CC3_CC3N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER19_CC3_CC3N_IRQHandler
        B TIMER19_CC3_CC3N_IRQHandler

        PUBWEAK TIMER20_CC0_CC0N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER20_CC0_CC0N_IRQHandler
        B TIMER20_CC0_CC0N_IRQHandler

        PUBWEAK TIMER20_CC1_CC1N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER20_CC1_CC1N_IRQHandler
        B TIMER20_CC1_CC1N_IRQHandler

        PUBWEAK TIMER20_CC2_CC2N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER20_CC2_CC2N_IRQHandler
        B TIMER20_CC2_CC2N_IRQHandler

        PUBWEAK TIMER20_CC3_CC3N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER20_CC3_CC3N_IRQHandler
        B TIMER20_CC3_CC3N_IRQHandler

        PUBWEAK TIMER60_CC0_CC0N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER60_CC0_CC0N_IRQHandler
        B TIMER60_CC0_CC0N_IRQHandler

        PUBWEAK TIMER60_CC1_CC1N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER60_CC1_CC1N_IRQHandler
        B TIMER60_CC1_CC1N_IRQHandler

        PUBWEAK TIMER60_CC2_CC2N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER60_CC2_CC2N_IRQHandler
        B TIMER60_CC2_CC2N_IRQHandler

        PUBWEAK TIMER60_CC3_CC3N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER60_CC3_CC3N_IRQHandler
        B TIMER60_CC3_CC3N_IRQHandler

        PUBWEAK TIMER61_CC0_CC0N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER61_CC0_CC0N_IRQHandler
        B TIMER61_CC0_CC0N_IRQHandler

        PUBWEAK TIMER61_CC1_CC1N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER61_CC1_CC1N_IRQHandler
        B TIMER61_CC1_CC1N_IRQHandler

        PUBWEAK TIMER61_CC2_CC2N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER61_CC2_CC2N_IRQHandler
        B TIMER61_CC2_CC2N_IRQHandler

        PUBWEAK TIMER61_CC3_CC3N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER61_CC3_CC3N_IRQHandler
        B TIMER61_CC3_CC3N_IRQHandler

        PUBWEAK TIMER62_CC0_CC0N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER62_CC0_CC0N_IRQHandler
        B TIMER62_CC0_CC0N_IRQHandler

