MaiLangYang/mcu_project_template/firmware/cmsis/GD/GD32A7xx/Source/IAR/startup_gd32a74xx.s
        PUBWEAK TIMER62_CC1_CC1N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER62_CC1_CC1N_IRQHandler
        B TIMER62_CC1_CC1N_IRQHandler

        PUBWEAK TIMER62_CC2_CC2N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER62_CC2_CC2N_IRQHandler
        B TIMER62_CC2_CC2N_IRQHandler

        PUBWEAK TIMER62_CC3_CC3N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER62_CC3_CC3N_IRQHandler
        B TIMER62_CC3_CC3N_IRQHandler

        PUBWEAK TIMER63_CC0_CC0N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER63_CC0_CC0N_IRQHandler
        B TIMER63_CC0_CC0N_IRQHandler

        PUBWEAK TIMER63_CC1_CC1N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER63_CC1_CC1N_IRQHandler
        B TIMER63_CC1_CC1N_IRQHandler

        PUBWEAK TIMER63_CC2_CC2N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER63_CC2_CC2N_IRQHandler
        B TIMER63_CC2_CC2N_IRQHandler

        PUBWEAK TIMER63_CC3_CC3N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER63_CC3_CC3N_IRQHandler
        B TIMER63_CC3_CC3N_IRQHandler

        PUBWEAK DMA0_Channel7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel7_IRQHandler
        B DMA0_Channel7_IRQHandler

        PUBWEAK DMA0_Channel8_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel8_IRQHandler
        B DMA0_Channel8_IRQHandler

        PUBWEAK DMA0_Channel9_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel9_IRQHandler
        B DMA0_Channel9_IRQHandler

        PUBWEAK DMA0_Channel10_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel10_IRQHandler
        B DMA0_Channel10_IRQHandler

        PUBWEAK DMA0_Channel11_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel11_IRQHandler
        B DMA0_Channel11_IRQHandler

        PUBWEAK DMA0_Channel12_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel12_IRQHandler
        B DMA0_Channel12_IRQHandler

        PUBWEAK DMA0_Channel13_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel13_IRQHandler
        B DMA0_Channel13_IRQHandler

        PUBWEAK DMA0_Channel14_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel14_IRQHandler
        B DMA0_Channel14_IRQHandler

        PUBWEAK DMA0_Channel15_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA0_Channel15_IRQHandler
        B DMA0_Channel15_IRQHandler

        PUBWEAK DMA1_Channel5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel5_IRQHandler
        B DMA1_Channel5_IRQHandler

        PUBWEAK DMA1_Channel6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel6_IRQHandler
        B DMA1_Channel6_IRQHandler

        PUBWEAK DMA1_Channel7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel7_IRQHandler
        B DMA1_Channel7_IRQHandler

        PUBWEAK DMA1_Channel8_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel8_IRQHandler
        B DMA1_Channel8_IRQHandler

        PUBWEAK DMA1_Channel9_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel9_IRQHandler
        B DMA1_Channel9_IRQHandler

        PUBWEAK DMA1_Channel10_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel10_IRQHandler
        B DMA1_Channel10_IRQHandler

        PUBWEAK DMA1_Channel11_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel11_IRQHandler
        B DMA1_Channel11_IRQHandler

        PUBWEAK DMA1_Channel12_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel12_IRQHandler
        B DMA1_Channel12_IRQHandler

        PUBWEAK DMA1_Channel13_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel13_IRQHandler
        B DMA1_Channel13_IRQHandler

        PUBWEAK DMA1_Channel14_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel14_IRQHandler
        B DMA1_Channel14_IRQHandler

        PUBWEAK DMA1_Channel15_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel15_IRQHandler
        B DMA1_Channel15_IRQHandler

        PUBWEAK MCMUA_RX_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MCMUA_RX_IRQHandler
        B MCMUA_RX_IRQHandler

        PUBWEAK MCMUA_TX_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MCMUA_TX_IRQHandler
        B MCMUA_TX_IRQHandler

        PUBWEAK MCMUA_NORMAL_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MCMUA_NORMAL_IRQHandler
        B MCMUA_NORMAL_IRQHandler

        PUBWEAK MCMUB_RX_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MCMUB_RX_IRQHandler
        B MCMUB_RX_IRQHandler

        PUBWEAK MCMUB_TX_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MCMUB_TX_IRQHandler
        B MCMUB_TX_IRQHandler

        PUBWEAK MCMUB_NORMAL_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MCMUB_NORMAL_IRQHandler
        B MCMUB_NORMAL_IRQHandler

        PUBWEAK LIN0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LIN0_IRQHandler
        B LIN0_IRQHandler

        PUBWEAK LIN1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LIN1_IRQHandler
        B LIN1_IRQHandler

        PUBWEAK LIN2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LIN2_IRQHandler
        B LIN2_IRQHandler

        PUBWEAK LIN3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LIN3_IRQHandler
        B LIN3_IRQHandler

        PUBWEAK LIN4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LIN4_IRQHandler
        B LIN4_IRQHandler

        PUBWEAK LIN5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LIN5_IRQHandler
        B LIN5_IRQHandler

        PUBWEAK LIN6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LIN6_IRQHandler
        B LIN6_IRQHandler

        PUBWEAK LIN7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LIN7_IRQHandler
        B LIN7_IRQHandler

        PUBWEAK LIN8_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LIN8_IRQHandler
        B LIN8_IRQHandler

        PUBWEAK LIN9_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LIN9_IRQHandler
        B LIN9_IRQHandler

