MaiLangYang/mcu_project_template/firmware/cmsis/GD/GD32A7xx/Source/IAR/startup_gd32a74xx.s
        PUBWEAK LIN10_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LIN10_IRQHandler
        B LIN10_IRQHandler

        PUBWEAK LIN11_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LIN11_IRQHandler
        B LIN11_IRQHandler

        PUBWEAK TIMER0_CC0_CC0N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER0_CC0_CC0N_IRQHandler
        B TIMER0_CC0_CC0N_IRQHandler

        PUBWEAK TIMER0_CC1_CC1N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER0_CC1_CC1N_IRQHandler
        B TIMER0_CC1_CC1N_IRQHandler

        PUBWEAK TIMER0_CC2_CC2N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER0_CC2_CC2N_IRQHandler
        B TIMER0_CC2_CC2N_IRQHandler

        PUBWEAK TIMER0_CC3_CC3N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER0_CC3_CC3N_IRQHandler
        B TIMER0_CC3_CC3N_IRQHandler

        PUBWEAK TIMER7_CC0_CC0N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER7_CC0_CC0N_IRQHandler
        B TIMER7_CC0_CC0N_IRQHandler

        PUBWEAK TIMER7_CC1_CC1N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER7_CC1_CC1N_IRQHandler
        B TIMER7_CC1_CC1N_IRQHandler

        PUBWEAK TIMER7_CC2_CC2N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER7_CC2_CC2N_IRQHandler
        B TIMER7_CC2_CC2N_IRQHandler

        PUBWEAK TIMER7_CC3_CC3N_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER7_CC3_CC3N_IRQHandler
        B TIMER7_CC3_CC3N_IRQHandler

        PUBWEAK TIMER1_CC0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER1_CC0_IRQHandler
        B TIMER1_CC0_IRQHandler

        PUBWEAK TIMER1_CC1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER1_CC1_IRQHandler
        B TIMER1_CC1_IRQHandler

        PUBWEAK TIMER1_CC2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER1_CC2_IRQHandler
        B TIMER1_CC2_IRQHandler

        PUBWEAK TIMER1_CC3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER1_CC3_IRQHandler
        B TIMER1_CC3_IRQHandler

        PUBWEAK TIMER2_CC0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER2_CC0_IRQHandler
        B TIMER2_CC0_IRQHandler

        PUBWEAK TIMER2_CC1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER2_CC1_IRQHandler
        B TIMER2_CC1_IRQHandler

        PUBWEAK TIMER2_CC2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER2_CC2_IRQHandler
        B TIMER2_CC2_IRQHandler

        PUBWEAK TIMER2_CC3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER2_CC3_IRQHandler
        B TIMER2_CC3_IRQHandler

        PUBWEAK FWDGT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FWDGT_IRQHandler
        B FWDGT_IRQHandler

        PUBWEAK ETH_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ETH_IRQHandler
        B ETH_IRQHandler

        PUBWEAK ETH_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ETH_WKUP_IRQHandler
        B ETH_WKUP_IRQHandler

        PUBWEAK ETH_TX_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ETH_TX_IRQHandler
        B ETH_TX_IRQHandler

        PUBWEAK ETH_RX_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ETH_RX_IRQHandler
        B ETH_RX_IRQHandler

        PUBWEAK ETH_SAFETY_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ETH_SAFETY_IRQHandler
        B ETH_SAFETY_IRQHandler

        PUBWEAK RCU_CK_FAIL_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RCU_CK_FAIL_IRQHandler
        B RCU_CK_FAIL_IRQHandler

        PUBWEAK CAN5_ECCERR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN5_ECCERR_IRQHandler
        B CAN5_ECCERR_IRQHandler

        PUBWEAK TIMER60_BRK_UP_TRG_CMT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER60_BRK_UP_TRG_CMT_IRQHandler
        B TIMER60_BRK_UP_TRG_CMT_IRQHandler

        PUBWEAK TIMER61_BRK_UP_TRG_CMT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER61_BRK_UP_TRG_CMT_IRQHandler
        B TIMER61_BRK_UP_TRG_CMT_IRQHandler

        PUBWEAK TIMER62_BRK_UP_TRG_CMT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER62_BRK_UP_TRG_CMT_IRQHandler
        B TIMER62_BRK_UP_TRG_CMT_IRQHandler

        PUBWEAK TIMER63_BRK_UP_TRG_CMT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER63_BRK_UP_TRG_CMT_IRQHandler
        B TIMER63_BRK_UP_TRG_CMT_IRQHandler

        PUBWEAK TIMER5_CH0_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER5_CH0_UP_IRQHandler
        B TIMER5_CH0_UP_IRQHandler

        PUBWEAK TIMER5_CH1_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER5_CH1_UP_IRQHandler
        B TIMER5_CH1_UP_IRQHandler

        PUBWEAK TIMER5_CH2_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER5_CH2_UP_IRQHandler
        B TIMER5_CH2_UP_IRQHandler

        PUBWEAK TIMER5_CH3_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER5_CH3_UP_IRQHandler
        B TIMER5_CH3_UP_IRQHandler

        PUBWEAK TIMER6_CH0_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER6_CH0_UP_IRQHandler
        B TIMER6_CH0_UP_IRQHandler

        PUBWEAK TIMER6_CH1_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER6_CH1_UP_IRQHandler
        B TIMER6_CH1_UP_IRQHandler

        PUBWEAK TIMER6_CH2_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER6_CH2_UP_IRQHandler
        B TIMER6_CH2_UP_IRQHandler

        PUBWEAK TIMER6_CH3_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER6_CH3_UP_IRQHandler
        B TIMER6_CH3_UP_IRQHandler

        PUBWEAK CAN6_ECCERR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN6_ECCERR_IRQHandler
        B CAN6_ECCERR_IRQHandler

        PUBWEAK CAN7_ECCERR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN7_ECCERR_IRQHandler
        B CAN7_ECCERR_IRQHandler

        END
